diplom-src/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ПланированиеОтпусков</registerRecords>
  <attributes>
    <name>ВКМ_Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_ОтпускаСотрудников</name>
    <attributes>
      <name>ВКМ_Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ВсегоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/AccumulationRegisters/ВКМ_ПланированиеОтпусков/ВКМ_ПланированиеОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ПланированиеОтпусков</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ВКМ_ВсегоДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВКМ_ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВКМ_ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВКМ_Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

diplom-src/src/Documents/ВКМ_ГрафикОтпусков/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ВКМ_ПланированиеОтпусков.Записывать = Истина;
	Для Каждого ТекСтрокаВКМ_ОтпускаСотрудников Из ВКМ_ОтпускаСотрудников Цикл
		Движение = Движения.ВКМ_ПланированиеОтпусков.Добавить();
		Движение.Период = Дата;
		Движение.ВКМ_Сотрудник = ТекСтрокаВКМ_ОтпускаСотрудников.ВКМ_Сотрудник;
		Движение.ВКМ_ДатаНачала = ТекСтрокаВКМ_ОтпускаСотрудников.ВКМ_ДатаНачала;
		Движение.ВКМ_ДатаОкончания = ТекСтрокаВКМ_ОтпускаСотрудников.ВКМ_ДатаОкончания;
		Движение.ВКМ_ВсегоДней = ТекСтрокаВКМ_ОтпускаСотрудников.ВКМ_ВсегоДней;
		Движение.ВКМ_Год = ВКМ_Год;
	КонецЦикла;

КонецПроцедуры
